# TrackObject

## Description
Interactively, including highlighting, allows the user to select one object meeting the specified criteria.

The callback function (any of these depending on what info is needed):

```pascal
FUNCTION Callback(h : HANDLE): BOOLEAN;
FUNCTION CheckObjCallback(h : HANDLE; px, py : REAL) : BOOLEAN;
FUNCTION CheckObjCallback(h : HANDLE; px, py, pz : REAL) : BOOLEAN;
```

is used to let the user filter the object that can be returned from the function.

The parameter px, py, pz pass into the function information about current cursor position in document units.

This callback function is called when tracking over an object; also when click happens over an object.
Returns true if the passed handle can be returned.

```pascal
PROCEDURE TrackObject(
				callback       : PROCEDURE;
				VAR outObj     : HANDLE;
				VAR px, py, pz : REAL);
```

```python
def vs.TrackObject(callback):
    return (outObj, p)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|callback|PROCEDURE|The callback that will be called to check if an object meets the requirements to be tracked. See remarks.|
|outObj|HANDLE|Returns handle to the selected from the temp tool object.|
|p|REAL|Returns coordinates of mouse click.|

## Remarks
\_c\_, (2011 Oct. 03): The user is always prompted to select a point, similar to using  GetPt, and this point seems to be the required criteria. So the description is a bit misleading, since you might believe that the routine takes care of the point all by itself, which doesn't happen.

## Examples
#### VectorScript ####
```pascal
PROCEDURE Test;
VAR
  h : HANDLE;
  x, y, z : REAL;

  FUNCTION CheckObjCallback(h : HANDLE) : BOOLEAN;
  {or FUNCTION CheckObjCallback(h : HANDLE; px, py : REAL) : BOOLEAN;}
  {or FUNCTION CheckObjCallback(h : HANDLE; px, py, pz : REAL) : BOOLEAN;}
  BEGIN
     {any object is ok}
     CheckObjCallback := true;
  END;

BEGIN
     TrackObject( CheckObjCallback, h, x, y, z );
     IF h <> NIL THEN
          SetSelect( h );
END;
RUN( Test );
```
#### Python ####
```python

```

```pascal
SetTempToolHelpStr(GetPlugInString(3007));
STRING3005 := GetPlugInString(3005);
STRING3006 := GetPlugInString(3006);
REPEAT
TrackObject( CheckObjCallback, TempHandle1,TempXLoc, TempYLoc, TempZLoc );

BEGIN
 	TrackObject( CheckObjCallback, hObject, X, Y, Z );
 	wasShiftPressed := Shift;
END;

{TheCable := PickObject(Click.X,Click.Y);}
AlrtDialog(GetPlugInString(3000)); {Click on first point}
TrackObject(CheckObjCallback, TheCable, Click.X, Click.Y, Click.Z);
SetSelect(TheCable);
Pt1 := Click;
AlrtDialog(GetPlugInString(3001)); {Click on second point}
TrackObject(CheckObjCallback, TheCable, Click.X, Click.Y, Click.Z);
```
```python
result = vs.TrackObject(callback)
```

## See Also
VS Functions:
GetPt |
GetPtL |
GetPt3D |
GetPtL3D |
GetLine |
GetLine3D |
GetRect |
GetRect3D |
TrackObject

## Version
Availability: from Vectorworks 2010

## Category
* User Interactive